{
  "https://seller.flipkart.com/faq": [
    {
      "Q": null,
      "A": null
    }
  ],
  "https://www.flipkart.com/helpcentre/manageOrder/i/3": [
    {
      "Q": "How do I get help with my recent orders and issues?",
      "A": "Log in to get help with your recent orders and issues."
    }
  ],
  "https://en.wikipedia.org/wiki/Wikipedia:FAQ": [
    {
      "Q": "Main FAQ",
      "A": "Main FAQ about using and contributing to Wikipedia."
    },
    {
      "Q": "Overview FAQ",
      "A": "General questions about the Wikipedia project."
    },
    {
      "Q": "Readers' FAQ",
      "A": "Finding, reading and using Wikipedia material."
    },
    {
      "Q": "Schools' and Teachers' FAQ",
      "A": "Using Wikipedia in the classroom."
    },
    {
      "Q": "Contributing FAQ",
      "A": "Why you might want to contribute to the Wikipedia project, and how you can do it."
    },
    {
      "Q": "Editing FAQ",
      "A": "The ins and outs of creating and editing Wikipedia pages."
    },
    {
      "Q": "Administration FAQ",
      "A": "What an administrator (or \"sysop\") is, sysop status, and server administration."
    },
    {
      "Q": "Blocks FAQ",
      "A": "Information about blocks."
    },
    {
      "Q": "Technical FAQ",
      "A": "Questions about Wikipedia software and hardware and their limitations."
    },
    {
      "Q": "Problems FAQ",
      "A": "Questions relating to past or present difficulties and criticism."
    },
    {
      "Q": "Article subjects' FAQ",
      "A": "Questions relating to an article about you, someone you represent, or your organization or business"
    },
    {
      "Q": "Copyright FAQ",
      "A": "Questions pertaining to copyright issues."
    },
    {
      "Q": "Template FAQ",
      "A": "Questions about templates."
    },
    {
      "Q": "Miscellaneous FAQ",
      "A": "Everything else."
    },
    {
      "Q": "Forking FAQ",
      "A": "How to download Wikipedia content and/or software and/or create derivative works of Wikipedia."
    },
    {
      "Q": "Categorization FAQ",
      "A": "Editor's guide to the Category feature."
    },
    {
      "Q": "Categories FAQ",
      "A": "Readers' guide to categories."
    },
    {
      "Q": "Main Page FAQ",
      "A": "How it works and other common answers."
    },
    {
      "Q": "ClueBot NG FAQ",
      "A": "Specific to ClueBot NG"
    }
  ],
  "https://en.wikipedia.org/wiki/Wikipedia:FAQ/Main": [
    {
      "Q": "How do I edit a page?",
      "A": "Editing most Wikipedia pages is easy! Simply click the \"Edit\" tab at the top of a Wikipedia page or on a section-edit link. This will take you to a new page with a text box containing the editable text of the page you were viewing. In this box, you can type in the text that you want to add using wiki markup to format text and add other elements like images and tables. If you don't want to learn the wiki markup syntax, you can enable the VisualEditor, which allows you to edit pages in a user-friendly way. When you have finished editing, you should write a short edit summary in the small field below the edit-box describing your changes."
    },
    {
      "Q": "How do I create a new page?",
      "A": "You have to be logged in to your Wikipedia account to create a new article. You can register here. For creating a new article, see Help:Your first article and Wikipedia:Article development. You may also wish to try the Article wizard. For creating a new page in your userspace, see How do I create a user subpage?, or use the Article wizard, which has an option for that. Make sure that the new page is backed up by reliable sources and that its subject is notable."
    },
    {
      "Q": "Why was my article deleted?",
      "A": "If you look at the address where your page was, it should have a red box above it that shows the user who deleted it (in the form \"Username (talk | contribs)\") and their reason (which appears in italics). If the reason is not helpful, or you disagree with it, you can click on the \"talk\" link to send them a message and ask."
    },
    {
      "Q": "How do I change the name of an article?",
      "A": "You can move the article using the \"move\" link under \"Tools\" in the sidebar. In order to do this on most pages, you must have an account that has reached autoconfirmed status, meaning it must be at least four days old and have made at least ten edits. If you are not an autoconfirmed user, if the move is controversial, or if the page you wish to rename is move-protected, visit Wikipedia:Requested moves. You may also request to have an admin grant you confirmed status if you are a legitimate alternative account of an autoconfirmed user."
    },
    {
      "Q": "How do I change my username/delete my account?",
      "A": "To change your username, see Wikipedia:Changing username. An account cannot be deleted. If an account was deleted, the edits made by the user could not be properly attributed. You can, however, courtesy vanish, and request that your userpage be deleted by adding the code {{db-user}} to the top of the page."
    },
    {
      "Q": "How do I cite Wikipedia?",
      "A": "See Wikipedia:Citing Wikipedia for details."
    },
    {
      "Q": "Who writes the articles on Wikipedia?",
      "A": "Almost all articles on Wikipedia are written by multiple editors, not just one. If you click on the \"View history\" tab at the top of an article, a list of all the contributors to the article will be displayed, along with the time when their contributions were made. A more comprehensive history can be accessed in the \"Page statistics\" which can be found in the External tools of the \"View history\" tab. See Who writes Wikipedia for further details."
    },
    {
      "Q": "Can I rely on Wikipedia for advice on medical, legal, financial, safety, and other critical issues?",
      "A": "In a word, no. If you need specific advice (for example, medical, legal, financial or risk management), please seek a professional who is licensed or knowledgeable in that area. Wikipedia cannot guarantee the validity of the information found here. The content of any given article may recently have been changed, vandalized or altered by someone whose opinion does not correspond with the state of knowledge in the relevant fields. See Wikipedia:General disclaimer for more cautionary information."
    },
    {
      "Q": "Who owns Wikipedia?",
      "A": "See who owns Wikipedia for details."
    },
    {
      "Q": "Why am I having trouble logging in?",
      "A": "See Help:Logging in for details."
    },
    {
      "Q": "How can I contact Wikipedia?",
      "A": "See Wikipedia:Contact us for information."
    }
  ],
  "https://www.myntra.com/faqs": [],
  "https://cwiki.apache.org/confluence/display/httpd/FAQ": [
    {
      "Q": "What is Apache?",
      "A": "The Apache HTTP Server is a powerful, flexible, HTTP/1.1 compliant web server implements the latest protocols, including HTTP/1.1 (RFC2616) is highly configurable and extensible with third-party modules can be customised by writing 'modules' using the Apache module API provides full source code and comes with an unrestrictive license runs on Windows 2000, Netware 5.x and above, OS/2, and most versions of Unix, as well as several other operating systems is actively being developed encourages user feedback through new ideas, bug reports and patches implements many frequently requested features, including: DBM databases as well, as relational databases and LDAP for authentication allows you to easily set up password-protected pages with enormous numbers of authorized users, without bogging down the server. Customized responses to errors and problems Allows you to set up files, or even CGI scripts, which are returned by the server in response to errors and problems, e.g. setup  a script to intercept 500 Server Errors and perform on-the-fly diagnostics for both users and yourself. Multiple DirectoryIndex directives - Allows you to say DirectoryIndex index.html index.cgi, which instructs the server to either send back index.html or run index.cgi when a directory URL is requested, whichever it finds in the directory. Unlimited flexible URL rewriting and aliasing - Apache has no fixed limit on the numbers of Aliases and Redirects which may be declared in the config files. In addition, a powerful rewriting engine can be used to solve most URL manipulation problems. Content negotiation - i.e. the ability to automatically serve clients of varying sophistication and HTML level compliance, with documents which offer the best representation of information that the client is capable of accepting. Virtual Hosts - Allows the server to distinguish between requests made to different IP addresses or names (mapped to the same machine). Apache also offers dynamically configurable mass-virtual hosting. Configurable Reliable Piped Logs - You can configure Apache to generate logs in the format that you want. In addition, on most Unix architectures, Apache can send log files to a pipe, allowing for log rotation, hit filtering, real-time splitting of multiple vhosts into separate logs, and asynchronous DNS resolving on the fly."
    },
    {
      "Q": "How and why was Apache HTTP Server created?",
      "A": "The About Apache document explains how the Apache project evolved from its beginnings as an outgrowth of the NCSA httpd project to its current status as one of the fastest, most efficient, and most functional web servers in existence."
    },
    {
      "Q": "Why the name \"Apache\"?",
      "A": "The name 'Apache' was chosen from respect for the Native American Indian tribe of Apache (Indé), well-known for their superior skills in warfare strategy and their inexhaustible endurance. For more information on the Apache Nation, we suggest searching Google, or AllTheWeb . Secondarily, and more popularly (though incorrectly) accepted, it's a considered cute name which stuck. Apache is \"A PAtCHy server\". It was based on some existing code and a series of \"patch files\". These days Apache as such means much more. It's first and foremost the Apache Software Foundation, under which there are dozens of projects."
    },
    {
      "Q": "How does Apache httpd performance compare to other servers?",
      "A": "Benchmarks tend to be a measure of configuration competance, rather than of server quality. That is, if you're an expert in IIS, you can probably get it to run faster than you can get Apache to run. You can therefore find comparisions of various HTTP servers that prove that each is faster than all the others. We tend to take server performance benchmarks with a grain of salt."
    },
    {
      "Q": "How thoroughly tested is Apache httpd?",
      "A": "Apache is run on over 120 million Internet servers (as of April 2010) (Source, Netcraft ). It has been tested thoroughly by both developers and users. The Apache HTTP Server Project Management Committee maintains rigorous standards before releasing new versions of their server, and our server runs without a hitch on over one half of all WWW servers available on the Internet. When bugs do show up, we release patches and new versions as soon as they are available."
    },
    {
      "Q": "What are the future plans for Apache httpd?",
      "A": "to continue to be an \"open source\" no-charge-for-use HTTP server, to keep up with advances in HTTP protocol and web developments in general, to collect suggestions for fixes/improvements from its users, to respond to needs of large volume providers as well as occasional users."
    },
    {
      "Q": "Whom do I contact for support?",
      "A": "See http://httpd.apache.org/support.html ."
    },
    {
      "Q": "Is there any more information available on Apache httpd?",
      "A": "Indeed there is. See the main Apache web server site . There are also many books about the Apache HTTP Server available."
    },
    {
      "Q": "Where can I get Apache httpd?",
      "A": "You can find out how to download the source for Apache at the main Apache web server site ."
    },
    {
      "Q": "Why isn't there a current binary for my platform?",
      "A": "The occasional availability of binaries for one platform or another at http://httpd.apache.org/dist/httpd/binaries/ has been a source of confusion for the user community, particularly the large subset which uses the Windows platform and is not able to build httpd and prerequisites themselves. Producing binaries for general use is not part of the httpd release process.  By policy the group does not formally release binaries and is in no position to ensure their consistent availability.  (No mechanisms exist to review, test, and approve them – we can only formally release source). If you are unable to build a binary for your platform, consult the Users mailing list for recommendations. Some sources for Windows binaries are documented at Using Apache HTTP Server on Microsoft Windows ."
    },
    {
      "Q": "May I use the Apache logo on my product or Web site?",
      "A": "You may NOT use any original artwork from the Apache Software Foundation, nor make or use modified versions of such artwork, except under the conditions in the Apache Trademark Policy document."
    },
    {
      "Q": "\"Why can't I ...? Why won't ... work?\" What to do in case of problems",
      "A": "If you are having trouble with your Apache server software, you should take the following steps: Check the errorlog! Check the FAQ! Check the Apache bug database Ask in a user support group If all else fails, report the problem in the bug database If your problem involves the server crashing and generating a core dump, please include a backtrace (if possible). As an example, # cd ServerRoot\n# dbx httpd core\n(dbx) where (Substitute the appropriate locations for your ServerRoot and your httpd and core files. You may have to use gdb instead of dbx.)"
    },
    {
      "Q": "How do I submit a patch to Apache httpd?",
      "A": "Detailed information for submitting bug reports and patches may be found in the Apache HTTP Server developer documentation ."
    },
    {
      "Q": "Why has Apache stolen my favourite site's Internet address?",
      "A": "The simple answer is: \"It hasn't.\" This misconception is usually caused by the site in question having migrated to the Apache Web server software, but not having migrated the site's content yet. When Apache is installed, the default page that gets installed tells the Webmaster the installation was successful. The expectation is that this default page will be replaced with the site's real content. If it doesn't, complain to the Webmaster, not to the Apache project – we just make the software and aren't responsible for what people do (or don't do) with it."
    },
    {
      "Q": "Why am I getting spam mail from the Apache site?",
      "A": "The short answer is: \"You aren't.\" Usually when someone thinks the Apache site is originating spam, it's because they've traced the spam to a Web site, and the Web site says it's using Apache. See the previous FAQ entry for more details on this phenomenon. No marketing spam originates from the Apache site. The only mail that comes from the site goes only to addresses that have been requested to receive the mail."
    },
    {
      "Q": "May I include the Apache software on a CD or other package I'm distributing?",
      "A": "The detailed answer to this question can be found in the Apache license, which is included in the Apache distribution in the file LICENSE. You can also find it on the Web at http://www.apache.org/licenses/ ."
    },
    {
      "Q": "What's the best hardware/operating system/... How do I get the most out of my Apache Web server?",
      "A": "Check out the performance tuning page ."
    },
    {
      "Q": "What are \"regular expressions\"?",
      "A": "Regular expressions are a way of describing a pattern - for example, \"all the words that begin with the letter A\" or \"every 10-digit phone number\" or even \"Every sentence with two commas in it, and no capital letter Q\". Regular expressions (aka \"regex\"s) are useful in Apache because they let you apply certain attributes against collections of files or resources in very flexible ways - for example, all .gif and .jpg files under any \"images\" directory could be written as /images/.*(jpg|gif)$ . Note that httpd doesn't need the delimiting // so as to avoid \"toothpicks\" when matching URIs or paths, like: //foo/bar/?/ The best overview around is probably the one which comes with Perl .  Apache's regular expressions use PCRE - Perl Compatible Regular Expressions ."
    },
    {
      "Q": "Why do I get an error about an undefined reference to \"+inet_ntoa\" or other +inet_* symbols?",
      "A": "If you have installed BIND-8 then this is normally due to a conflict between your include files and your libraries. BIND-8 installs its include files and libraries /usr/local/include/ and /usr/local/lib/, while the resolver that comes with your system is probably installed in /usr/include/ and /usr/lib/. If your system uses the header files in /usr/local/include/ before those in /usr/include/ but you do not use the new resolver library, then the two versions will conflict. To resolve this, you can either make sure you use the include files and libraries that came with your system or make sure to use the new include files and libraries. Adding -lbind to the EXTRA_LDFLAGS line in your Configuration file, then re-running Configure, should resolve the problem. (Apache versions 1.2.* and earlier use EXTRA_LFLAGS instead.) Note:As of BIND 8.1.1, the bind libraries and files are installed under /usr/local/bind by default, so you should not run into this problem. Should you want to use the bind resolvers you'll have to add the following to the respective lines: EXTRA_CFLAGS=-I/usr/local/bind/include EXTRA_LDFLAGS=-L/usr/local/bind/lib EXTRA_LIBS=-lbind"
    },
    {
      "Q": "I get an error about \"configure failed for srclib/apr\"",
      "A": "This only applies to Apache 2.4 and later If you are building with the --with-included-apr option, you also need to download the *-deps tarball that matches the main release that you are trying to build, and extract it into the same directory."
    },
    {
      "Q": "Why won't Apache compile with my system's cc?",
      "A": "If the server won't compile on your system, it is probably due to one of the following causes: The Configure script doesn't recognize your system environment. Your system's C compiler is garbage. Your include files may be confused. Your operating system or compiler may be out of revision. The Apache Group tests the ability to build the server on many different platforms. Unfortunately, we can't test all of the OS platforms there are. If you have verified that none of the above issues is the cause of your problem, and it hasn't been reported before, please submit a problem report. Be sure to include complete details, such as the compiler & OS versions and exact error messages."
    },
    {
      "Q": "Why do I get complaints about redefinition of \"struct iovec\" when compiling under Linux?",
      "A": "This is a conflict between your C library includes and your kernel includes. You need to make sure that the versions of both are matched properly. There are two workarounds, either one will solve the problem: Remove the definition of struct iovec from your C library includes. It is located in /usr/include/sys/uio.h. Or, Add -DNO_WRITEV to the EXTRA_CFLAGS line in your Configuration and reconfigure/rebuild. This hurts performance and should only be used as a last resort."
    },
    {
      "Q": "I'm using gcc and I get some compilation errors, what is wrong?",
      "A": "GCC parses your system header files and produces a modified subset which it uses for compiling. This behavior ties GCC tightly to the version of your operating system. So, for example, if you were running IRIX 5.3 when you built GCC and then upgrade to IRIX 6.2 later, you will have to rebuild GCC. Similarly for Solaris 2.4, 2.5, or 2.5.1 when you upgrade to 2.6. Sometimes you can type \"gcc -v\" and it will tell you the version of the operating system it was built against. If you fail to do this, then it is very likely that Apache will fail to build. One of the most common errors is with readv, writev, or uio.h. This is not a bug with Apache. You will need to re-install GCC."
    },
    {
      "Q": "Why do I get \"setgid: Invalid argument\" at startup?",
      "A": "Your Group directive (probably in conf/httpd.conf) needs to name a group that actually exists in the /etc/group file (or your system's equivalent). This problem is also frequently seen when a negative number is used in the Group directive (e.g., \"Group #-1\"). Using a group name – not group number – found in your system's group database should solve this problem in all cases."
    },
    {
      "Q": "Why am I getting \"httpd: could not set socket option TCP_NODELAY\" in my error log?",
      "A": "This message almost always indicates that the client disconnected before Apache reached the point of calling setsockopt() for the connection. It shouldn't occur for more than about 1% of the requests your server handles, and it's advisory only in any case."
    },
    {
      "Q": "Why am I getting \"connection reset by peer\" in my error log?",
      "A": "This is a normal message and nothing about which to be alarmed. It simply means that the client canceled the connection before it had been completely set up - such as by the end-user pressing the \"Stop\" button. People's patience being what it is, sites with response-time problems or slow network links may experience this more than high capacity ones or those with large pipes to the network."
    },
    {
      "Q": "The errorlog says Apache dumped core, but where's the dump file?",
      "A": "The error log message about dumped core includes the directory where the dump file should be located. However, many Unixes do not allow a process that has called setuid() to dump core for security reasons ('Is this still a problem?'); the typical Apache setup has the server started as root to bind to port 80, after which it uses setuid() to change UIDs to a non-privileged user to serve requests. Dealing with this is extremely operating system-specific, and may require rebuilding your system kernel. Consult your operating system documentation or vendor for more information about whether your system does this and how to bypass it. If there is a documented way of bypassing it, it is recommended that you bypass it only for the httpd server process if possible. The canonical location for Apache's core-dump files is the ServerRoot directory. The location can be set via the CoreDumpDirectory directive to a different directory. Make sure that this directory is writable by the user the server runs as (as opposed to the user the server is started as)."
    },
    {
      "Q": "When I run it under Linux I get \"shmget: function not found\", what should I do?",
      "A": "Your kernel has been built without SysV IPC support. You will have to rebuild the kernel with that support enabled (it's under the \"General Setup\" submenu). Documentation for kernel building is beyond the scope of this FAQ; you should consult the Kernel HOWTO, or the documentation provided with your distribution, or a Linux newsgroup/mailing list. As a last-resort workaround, you can comment out the #define USE_SHMGET_SCOREBOARD definition in the LINUX section of src/conf.h and rebuild the server (prior to 1.3b4, simply removing #define HAVE_SHMGET would have sufficed). This will produce a server which is slower and less reliable."
    },
    {
      "Q": "Server hangs, or fails to start, and/or error log fills with \"fcntl: F_SETLKW: No record locks available\" or similar messages",
      "A": "These are symptoms of a file locking problem, which usually means that the server is trying to use a synchronization file on an NFS filesystem. Because of its parallel-operation model, the Apache Web server needs to provide some form of synchronization when accessing certain resources. One of these synchronization methods involves taking out locks on a file, which means that the filesystem whereon the lockfile resides must support locking. In many cases this means it can't be kept on an NFS-mounted filesystem. To cause the Web server to work around the NFS locking limitations, include a line such as the following in your server configuration files: LockFile /var/run/apache-lock The directory should not be generally writable (e.g., don't use /var/tmp). See the LockFile documentation for more information."
    },
    {
      "Q": "When I try to start Apache from a DOS window, I get a message like \"Cannot determine host name. Use ServerName directive to set it manually.\" What does this mean?",
      "A": "It means what it says; the Apache software can't determine the hostname of your system. Edit your conf\\httpd.conf file, look for the string \"ServerName\", and make sure there's an uncommented directive such as ServerName localhost or ServerName www.foo.com in the file. Correct it if there one there with wrong information, or add one if you don't already have one. Also, make sure that your Windows system has DNS enabled. See the TCP/IP setup component of the Networking or Internet Options control panel. After verifying that DNS is enabled and that you have a valid hostname in your ServerName directive, try to start the server again."
    },
    {
      "Q": "When I try to start Apache on Windows, I get a message like \"System error 1067 has occurred. The process terminated unexpectedly.\" What does this mean?",
      "A": "This message means that the Web server was unable to start correctly for one reason or another. To find out why, execute the following commands in a DOS window: c: cd \"\\Program Files\\Apache Group\\Apache\" apache (If you don't get the prompt back, hit Control-C to cause Apache to exit.) The error you see will probably be one of those preceding this question in the FAQ. First check the Windows NT Event Log for Application errors using the Windows NT/2000 Event Viewer program. Any errors that occur prior to opening the Apache error log will be stored here, if Apache is run as a Service on NT or 2000. As with any error, also check your Apache error log."
    },
    {
      "Q": "On a SuSE Linux system, I try and configure access control using basic authentication. Although I follow the example exactly, authentication fails, and an error message \"admin: not a valid FDN: ....\" is logged.",
      "A": "In the SuSE distribution, additional 3rd party authentication modules have been added and activated by default. These modules interfere with the Apache standard modules and cause Basic authentication to fail. Our recommendation is to comment all those modules in /etc/httpd/suse_addmodule.conf and /etc/httpd/suse_loadmodule.conf which are not actually required for running your server."
    },
    {
      "Q": "Why am I getting server restart messages periodically, when I did not restart the server?",
      "A": "Problem: You are noticing restart messages in your error log, periodically, when you know you did not restart the server yourself: [Thu Jun  6 04:02:01 2002] [notice] SIGHUP received.  Attempting to restart\n  [Thu Jun  6 04:02:02 2002] [notice] Apache configured -- resuming normal operations Check your cron jobs to see when/if your server logs are being rotated. Compare the time of rotation to the error message time. If they are the same, you can somewhat safely assume that the restart is due to your server logs being rotated."
    },
    {
      "Q": "Why am I getting \"module module-name is not compatible with this version of Apache\" messages in my error log?",
      "A": "Module Magic Number (MMN) is a constant defined in Apache source that is associated with binary compatibility of modules. It is changed when internal Apache structures, function calls and other significant parts of API change in such a way that binary compatibility cannot be guaranteed any more. On MMN change, all third party modules have to be at least recompiled, sometimes even slightly changed in order to work with the new version of Apache. If you're getting the above error messages, contact the vendor of the module for the new binary, or compile it if you have access to the source code."
    },
    {
      "Q": "I've downloaded a module from a source I trust, but my LoadModule line is a syntax error?",
      "A": "Have you checked for simple errors like a typo, or an incorrect path to the module? Another reason you may be unable to load a module is if it relies on libraries (Unix-family .so or Windows .dll) that are not loaded into the server.  Such libraries can be loaded using the LoadFile directive, which must appear before your LoadModule line in the configuration.  The module's provider should document any such dependencies.  There's a particular Gotcha on Windows: httpd: Syntax error on line nn of C:/IBM/HTTP/conf/httpd.conf: Cannot load C:/IBM/HTTP/modules/mod_foo.so into server: The specified module could not be found."
    },
    {
      "Q": "Googling the error message tells us there's a missing library, but there doesn't appear to be, and the identical configuration works on one computer but fails with this message on another.  What gives?",
      "A": "This error may happen because you need to install the Windows C Runtime Libraries on the target machine.  Note that this doesn't mean you need to load them explicitly into HTTPD, just install them on the host machine!  This is likely to affect users of IBM's httpd trying to load modules not supplied by IBM, and might arise in other circumstances where the server and the module are compiled using different build options."
    },
    {
      "Q": "Why can't I run more than <n> virtual hosts?",
      "A": "You are probably running into resource limitations in your operating system. The most common limitation is the per-process limit on file descriptors, which is almost always the cause of problems seen when adding virtual hosts. Apache often does not give an intuitive error message because it is normally some library routine (such as gethostbyname()) which needs file descriptors and doesn't complain intelligibly when it can't get them. Each log file requires a file descriptor, which means that if you are using separate access and error logs for each virtual host, each virtual host needs two file descriptors. Each Listen directive also needs a file descriptor. Typical values for <n> that we've seen are in the neighborhood of 1024 or 2048. When the server bumps into the file descriptor limit, it may dump core with a SIGSEGV, it might just hang, or it may limp along and you'll see (possibly meaningful) errors in the error log. One common problem that occurs when you run into a file descriptor limit is that CGI scripts stop being executed properly. As to what you can do about this: Reduce the number of Listen directives Reduce the number of log files Increase the number of file descriptors available to the server \"Don't do that\" - try to run with fewer virtual hosts Spread your operation across multiple server processes (using Listen for example, but see the first point) and/or ports. Since this is an operating-system limitation, there's not much else available in the way of solutions."
    },
    {
      "Q": "Why doesn't my ErrorDocument 401 work?",
      "A": "You need to use it with a URL in the form \"/foo/bar\" and not one with a method and hostname such as \"http://host/foo/bar\". See the ErrorDocument documentation for details. This was incorrectly documented in the past."
    },
    {
      "Q": "Why does Apache send a cookie on every response?",
      "A": "Apache does not automatically send a cookie on every response, unless you have re-compiled it with the mod_usertrack module, and specifically enabled it with the CookieTracking directive. This module may help track users, and uses cookies to do this. If you are not using the data generated by mod_usertrack, do not compile it into Apache."
    },
    {
      "Q": "Why don't my cookies work?",
      "A": "Apache httpd passes on your Set-Cookie header, like any other header. If cookies do not work it will be because your script does not work properly or your browser does not use cookies or is not set-up to accept them."
    },
    {
      "Q": "Why does accessing directories only work when I include the trailing \"/\" (e.g., http://foo.domain.com/~user/ ) but not when I omit it (e.g., http://foo.domain.com/~user)?",
      "A": "When you access a directory without a trailing \"/\", Apache needs to send what is called a redirect to the client to tell it to add the trailing slash. If it did not do so, relative URLs would not work properly. When it sends the redirect, it needs to know the name of the server so that it can include it in the redirect. There are two ways for Apache to find this out; either it can guess, or you can tell it. If your DNS is configured correctly, it can normally guess without any problems. If it is not, however, then you need to tell it. Add a ServerName directive to the config file to tell it what the domain name of the server is. The other thing that can occasionally cause this symptom is a misunderstanding of the Alias directive, resulting in an alias working with a trailing slash, and not without one. The Alias directive is very literal, and aliases what you tell it to. Consider the following example: Alias /example/ /home/www/example/ The above directive creates an alias for URLs starting with /example/, but does not alias URLs starting with /example. That is to say, a URL such as http://servername.com/example/ will get the desired content, but a URL such as http://servername.com/example will result in a \"file not found\" error. The following Alias, on the other hand, will work for both cases: Alias /example /home/www/example"
    },
    {
      "Q": "Why doesn't mod_info list any directives?",
      "A": "The mod_info module allows you to use a Web browser to see how your server is configured. Among the information it displays is the list of modules and their configuration directives. The \"current\" values for the directives are not necessarily those of the running server; they are extracted from the configuration files themselves at the time of the request. If the files have been changed since the server was last reloaded, the display will not match the values actively in use. If the files and the path to the files are not readable by the user as which the server is running (see the User directive), then mod_info cannot read them in order to list their values. An entry will be made in the error log in this event, however."
    },
    {
      "Q": "My .htaccess files are being ignored.",
      "A": "This is almost always due to your AllowOverride directive being set incorrectly for the directory in question. If it is set to None then .htaccess files will not even be looked for. That is a good thing. If you have access to edit the httpd.conf, you should not use .htaccess files, ever. If your customers do need support for .htaccess, make sure that AllowOverride is set to something sensible (i.e.: Not All). Be certain it covers the directory you are trying to use the .htaccess file in. This is normally accomplished by ensuring it is inside the proper Directory container. You can tell if this is your problem by adding nonsense text to your .htaccess file and reloading the page.  If you do not get a server error, then Apache httpd is not reading your .htaccess file."
    },
    {
      "Q": "Why do I get a \"Forbidden\" message whenever I try to access a particular directory?",
      "A": "This message is generally caused because either The underlying file system permissions do not allow the User/Group under which Apache is running to access the necessary files; or The Apache configuration has some access restrictions in place which forbid access to the files. You can determine which case applies to your situation by checking the error log. In the case where file system permission are at fault, see (13) Permission Denied for more info."
    },
    {
      "Q": "Why do my files appear correctly in Internet Explorer, but show up as source or trigger a save window with Netscape; or, Why doesn't Internet Explorer render my text/plain document correctly?",
      "A": "MS Internet Explorer (MSIE) and Netscape handle mime type detection in different ways, and therefore will display the document differently. In particular, IE sometimes relies on the file extension or the contents of the file to determine the mime type. This can happen when the server specifies a mime type of application/octet-stream or text/plain. This behavior violates the the HTTP standard and makes it impossible to deliver plain text documents to MSIE clients in some cases. More details are available on MSIE's mime type detection behavior in an MSDN article and a note by Alan J. Flavell. The best you can do as a server administrator is to accurately configure the mime type of your documents by editing the mime.types file or using an AddType directive in the Apache configuration files. In some cases, you may be able to fool MSIE into rendering text/plain documents correctly by assuring they have a .txt filename extension, but this will not work if MSIE thinks the content looks like another file type."
    },
    {
      "Q": "My site is accessible under many different hostnames; how do I redirect clients so that they see only a single name?",
      "A": "Many sites map a variety of hostnames to the same content. For example, www.example.com, example.com and www.example.net may all refer to the same site. It is best to make sure that, regardless of the name clients use to access the site, they will be redirected to a single, canonical hostname. This makes the site easier to maintain and assures that there will be only one version of the site in proxy caches and search engines. There are two techniques to implement canonical hostnames: Use mod_rewrite as described in the \"Canonical Hostnames\" section of the URL Rewriting Guide. See http://httpd.apache.org/docs/current/rewrite/remapping.html#canonicalhost . Use name-based virtual hosting: NameVirtualHost *:80\n<VirtualHost *:80>\n  ServerName www.example.net\n  ServerAlias example.com\n  Redirect permanent / http://www.example.com/\n</VirtualHost>\n\n<VirtualHost *:80>\n  ServerName www.example.com\n  DocumentRoot /usr/local/apache/htdocs\n</VirtualHost>"
    },
    {
      "Q": "Why can I access my website from the server or from my local network, but I can't access it from elsewhere on the Internet?",
      "A": "There are many possible reasons for this, and almost all of them are related to the configuration of your network, not the configuration of the Apache HTTP Server. One of the most common problems is that a firewall blocks access to the default HTTP port 80. In particular, many consumer ISPs block access to this port. You can see if this is the case by changing any Port and Listen directives in httpd.conf to use port 8000 and then request your site using http://yourhost.example.com:8000/ . (Of course, a very restrictive firewall may block this port as well.)"
    },
    {
      "Q": "How do I turn automatic directory listings on or off?",
      "A": "If a client requests a URL that designates a directory and the directory does not contain a filename that matches the DirectoryIndex directive, then mod_autoindex can be configured to present a listing of the directory contents. To turn on automatic directory indexing, find the Options directive that applies to the directory and add the Indexes keyword. For example: <Directory /path/to/directory>\n   Options +Indexes\n</Directory> To turn off automatic directory indexing, remove the Indexes keyword from the appropriate Options line. To turn off directory listing for a particular subdirectory, you can use Options -Indexes. For example: <Directory /path/to/directory>\n   Options -Indexes\n</Directory>"
    },
    {
      "Q": "Why do my Options directives not have the desired effect?",
      "A": "Directives placed in the configuration files are applied in a very particular order, as described by How Directory, Location, and Files sections work . In addition, each Options directive has the effect of resetting the options to none before adding the specified options (unless only \"+\" and \"-\" options are used). The consequence is that Options set in the main server or virtual host context (outside any directory, location, or files section) will usually have no effect, because they are overridden by more specific Options directives. For example, in the following <Directory /usr/local/apache/htdocs>\n    Options Indexes\n</Directory>\nOptions Includes ExecCGI Includes and ExecCGI will be off in the /usr/local/apache/htdocs directory. You can usually avoid problems by either finding the Options directive that already applies to a specific directory and changing it, or by putting your Options directive inside the most specific possible <Directory> section."
    },
    {
      "Q": "How can I change the information that Apache returns about itself in the headers?",
      "A": "When a client connects to Apache, part of the information returned in the headers is the name \"Apache\" Additional information that can be sent is the version number, such as \"2.2.17\", the operating system, and a list of non-standard modules you have installed. For example: Server: Apache/2.2.17 (Unix) mod_perl/1.26 Frequently, people want to remove this information, under the mistaken understanding that this will make the system more secure. This is probably not the case, as the same exploits will likely be attempted regardless of the header information you provide. There are, however, two answers to this question: the correct answer, and the answer that you are probably looking for. The correct answer to this question is that you should use the ServerTokens directive to alter the quantity of information which is passed in the headers. Setting this directive to Prod will pass the least possible amount of information: Server: Apache The answer you are probably looking for is how to make Apache lie about what what it is, ie send something like: Server: Bob's Happy HTTPd Server In order to do this, you will need to modify the Apache source code and rebuild Apache. This is not advised, as it is almost certain not to provide you with the added security you think that you are gaining. The exact method of doing this is left as an exercise for the reader, as we are not keen on helping you do something that is intrinsically a bad idea."
    }
  ],
  "https://aws.amazon.com/vpc/faqs/#topic-0": [
    {
      "Q": "What is Amazon Virtual Private Cloud?",
      "A": "Amazon VPC lets you provision a logically isolated section of the Amazon Web Services (AWS) cloud where you can launch AWS resources in a virtual network that you define. You have complete control over your virtual networking environment, including selection of your own IP address ranges, creation of subnets, and configuration of route tables and network gateways. You can also create a hardware Virtual Private Network (VPN) connection between your corporate datacenter and your VPC and leverage the AWS cloud as an extension of your corporate datacenter. You can easily customize the network configuration for your Amazon VPC. For example, you can create a public-facing subnet for your web servers that have access to the Internet, and place your backend systems such as databases or application servers in a private-facing subnet with no Internet access. You can leverage multiple layers of security, including security groups and network access control lists, to help control access to Amazon EC2 instances in each subnet."
    },
    {
      "Q": "What are the components of Amazon VPC?",
      "A": "Amazon VPC comprises a variety of objects that will be familiar to customers with existing networks: A Virtual Private Cloud: A logically isolated virtual network in the AWS cloud. You define a VPC’s IP address space from ranges you select. Subnet: A segment of a VPC’s IP address range where you can place groups of isolated resources. Internet Gateway: The Amazon VPC side of a connection to the public Internet. NAT Gateway: A highly available, managed Network Address Translation (NAT) service for your resources in a private subnet to access the Internet. Virtual private gateway: The Amazon VPC side of a VPN connection. Peering Connection: A peering connection enables you to route traffic via private IP addresses between two peered VPCs. VPC Endpoints: Enables private connectivity to services hosted in AWS, from within your VPC without using an Internet Gateway, VPN, Network Address Translation (NAT) devices, or firewall proxies. Egress-only Internet Gateway: A stateful gateway to provide egress only access for IPv6 traffic from the VPC to the Internet."
    },
    {
      "Q": "Why should I use Amazon VPC?",
      "A": "Amazon VPC enables you to build a virtual network in the AWS cloud - no VPNs, hardware, or physical datacenters required. You can define your own network space, and control how your network and the Amazon EC2 resources inside your network are exposed to the Internet. You can also leverage the enhanced security options in Amazon VPC to provide more granular access to and from the Amazon EC2 instances in your virtual network."
    },
    {
      "Q": "How do I get started with Amazon VPC?",
      "A": "Your AWS resources are automatically provisioned in a ready-to-use default VPC. You can choose to create additional VPCs by going to the Amazon VPC page in the AWS Management Console and selecting \"Start VPC Wizard\". You’ll be presented with four basic options for network architectures. After selecting an option, you can modify the size and IP address range of the VPC and its subnets. If you select an option with Hardware VPN Access, you will need to specify the IP address of the VPN hardware on your network. You can modify the VPC to add or remove secondary IP ranges and gateways, or add more subnets to IP ranges. The four options are: Amazon VPC with a single public subnet only Amazon VPC with public and private subnets Amazon VPC with public and private subnets and AWS Site-to-Site VPN access Amazon VPC with a private subnet only and AWS Site-to-Site VPN access"
    },
    {
      "Q": "What are the different types of VPC endpoints available on Amazon VPC?",
      "A": "VPC endpoints enable you to privately connect your VPC to services hosted on AWS without requiring an Internet gateway, a NAT device, VPN, or firewall proxies. Endpoints are horizontally scalable and highly available virtual devices that allow communication between instances in your VPC and AWS services. Amazon VPC offers two different types of endpoints: gateway type endpoints and interface type endpoints. Gateway type endpoints are available only for AWS services including S3 and DynamoDB. These endpoints will add an entry to your route table you selected and route the traffic to the supported services through Amazon’s private network. Interface type endpoints provide private connectivity to services powered by PrivateLink, being AWS services, your own services or SaaS solutions, and supports connectivity over Direct Connect. More AWS and SaaS solutions will be supported by these endpoints in the future. Please refer to VPC Pricing for the price of interface type endpoints."
    },
    {
      "Q": "How will I be charged and billed for my use of Amazon VPC?",
      "A": "There are no additional charges for creating and using the VPC itself. Usage charges for other Amazon Web Services, including Amazon EC2, still apply at published rates for those resources, including data transfer charges. If you connect your VPC to your corporate datacenter using the optional hardware VPN connection, pricing is per VPN connection-hour (the amount of time you have a VPN connection in the \"available\" state.) Partial hours are billed as full hours. Data transferred over VPN connections will be charged at standard AWS Data Transfer rates. For VPC-VPN pricing information, please visit the pricing section of the Amazon VPC product page ."
    },
    {
      "Q": "What usage charges will I incur if I use other AWS services, such as Amazon S3, from Amazon EC2 instances in my VPC?",
      "A": "Usage charges for other Amazon Web Services, including Amazon EC2, still apply at published rates for those resources. Data transfer charges are not incurred when accessing Amazon Web Services, such as Amazon S3, via your VPC’s Internet gateway. If you access AWS resources via your VPN connection, you will incur Internet data transfer charges."
    },
    {
      "Q": "What are the connectivity options for my Amazon VPC?",
      "A": "You may connect your Amazon VPC to: The internet (via an internet gateway) Your corporate data center using an AWS Site-to-Site VPN connection (via the virtual private gateway) Both the internet and your corporate data center (utilizing both an internet gateway and a virtual private gateway) Other AWS services (via internet gateway, NAT, virtual private gateway, or VPC endpoints) Other Amazon VPCs (via VPC peering connections)"
    },
    {
      "Q": "How do I connect my VPC to the Internet?",
      "A": "Amazon VPC supports the creation of an Internet gateway. This gateway enables Amazon EC2 instances in the VPC to directly access the Internet. You can also use an Egress-only internet gateway which is a stateful gateway to provide egress only access for IPv6 traffic from the VPC to the Internet."
    },
    {
      "Q": "Are there any bandwidth limitations for Internet gateways? Do I need to be concerned about its availability? Can it be a single point of failure?",
      "A": "No. An Internet gateway is horizontally-scaled, redundant, and highly available. It imposes no bandwidth constraints."
    },
    {
      "Q": "How do instances in a VPC access the Internet?",
      "A": "You can use public IP addresses, including Elastic IP addresses (EIPs) and IPv6 Global Unique addresses (GUA), to give instances in the VPC the ability to both directly communicate outbound to the internet and to receive unsolicited inbound traffic from the internet (e.g., web servers). You can also use the solutions in the next question."
    },
    {
      "Q": "When is an IP address considered a Public IP address?",
      "A": "Any IP address that is assigned to an instance or a service hosted in a VPC that can be accessed over the internet is considered a public IP address. Only public IPv4 addresses, including Elastic IP addresses (EIPs) and IPv6 GUA can be routable on the internet. To do so, you would need to first connect the VPC to the internet and then update the route table to make them reachable to/from the internet."
    },
    {
      "Q": "How do instances without public IP addresses access the Internet?",
      "A": "Instances without public IP addresses can access the Internet in one of two ways: Instances without public IP addresses can route their traffic through a NAT gateway or a NAT instance to access the Internet. These instances use the public IP address of the NAT gateway or NAT instance to traverse the Internet. The NAT gateway or NAT instance allows outbound communication but doesn’t allow machines on the Internet to initiate a connection to the privately addressed instances. For VPCs with a hardware VPN connection or Direct Connect connection, instances can route their Internet traffic down the virtual private gateway to your existing datacenter. From there, it can access the Internet via your existing egress points and network security/monitoring devices."
    },
    {
      "Q": "Can I connect to my VPC using a software VPN?",
      "A": "Yes. You may use a third-party software VPN to create a site to site or remote access VPN connection with your VPC via the Internet gateway."
    },
    {
      "Q": "Does traffic go over the internet when two instances communicate using public IP addresses, or when instances communicate with a public AWS service endpoint?",
      "A": "No. When using public IP addresses, all communication between instances and services hosted in AWS use AWS's private network. Packets that originate from the AWS network with a destination on the AWS network stay on the AWS global network, except traffic to or from AWS China Regions. In addition, all data flowing across the AWS global network that interconnects our data centers and Regions is automatically encrypted at the physical layer before it leaves our secured facilities. Additional encryption layers exist as well; for example, all VPC cross-region peering traffic, and customer or service-to-service Transport Layer Security (TLS) connections."
    },
    {
      "Q": "How does an AWS Site-to-Site VPN connection work with Amazon VPC?",
      "A": "An AWS Site-to-Site VPN connection connects your VPC to your datacenter. Amazon supports Internet Protocol Security (IPSec) VPN connections. Data transferred between your VPC and datacenter routes over an encrypted VPN connection to help maintain the confidentiality and integrity of data in transit. An internet gateway is not required to establish an AWS Site-to-Site VPN connection."
    },
    {
      "Q": "What IP address ranges can I use within my Amazon VPC?",
      "A": "You can use any IPv4 address range, including RFC 1918 or publicly routable IP ranges, for the primary CIDR block. For the secondary CIDR blocks, certain restrictions apply. Publicly routable IP blocks are only reachable via the Virtual Private Gateway and cannot be accessed over the Internet through the Internet gateway. AWS does not advertise customer-owned IP address blocks to the Internet. You can allocate up to 5 Amazon-provided or BYOIP IPv6 GUA CIDR blocks to a VPC by calling the relevant API or via the AWS Management Console."
    },
    {
      "Q": "How do I assign IP address ranges to Amazon VPCs?",
      "A": "You assign a single Classless Internet Domain Routing (CIDR) IP address range as the primary CIDR block when you create a VPC and can add up to four (4) secondary CIDR blocks after creation of the VPC. Subnets within a VPC are addressed from these CIDR ranges by you. Please note that while you can create multiple VPCs with overlapping IP address ranges, doing so will prohibit you from connecting these VPCs to a common home network via the hardware VPN connection. For this reason we recommend using non-overlapping IP address ranges. You can allocate up to 5 Amazon-provided or BYOIP IPv6 CIDR blocks to your VPC."
    },
    {
      "Q": "What IP address ranges are assigned to a default Amazon VPC?",
      "A": "Default VPCs are assigned a CIDR range of 172.31.0.0/16. Default subnets within a default VPC are assigned /20 netblocks within the VPC CIDR range."
    },
    {
      "Q": "Can I use my IP addresses in VPC and access them over the Internet?",
      "A": "Yes, you can bring your public IPv4 addresses and IPv6 GUA addresses into AWS VPC and statically allocate them to subnets and EC2 instances. To access these addresses over the Internet, you will have to advertise them to the Internet from your on-premises network. You will also have to route the traffic over these addresses between your VPC and on-premises network using AWS DX or AWS VPN connection. You can route the traffic from your VPC using the Virtual Private Gateway. Similarly, you can route the traffic from your on-premises network back to your VPC using your routers."
    },
    {
      "Q": "How large of a VPC can I create?",
      "A": "Currently, Amazon VPC supports five (5) IP address ranges, one (1) primary and four (4) secondary for IPv4. Each of these ranges can be between /28 (in CIDR notation) and /16 in size. The IP address ranges of your VPC should not overlap with the IP address ranges of your existing network. For IPv6, the VPC is a fixed size of /56 (in CIDR notation). A VPC can have both IPv4 and IPv6 CIDR blocks associated to it."
    },
    {
      "Q": "Can I change the size of a VPC?",
      "A": "Yes. You can expand your existing VPC by adding four (4) secondary IPv4 IP ranges (CIDRs) to your VPC. You can shrink your VPC by deleting the secondary CIDR blocks you have added to your VPC. Likewise, you can add up to five (5) additionally IPv6 IP ranges (CIDRs) to your VPC. You can shrink your VPC by deleting these additional ranges."
    },
    {
      "Q": "How many subnets can I create per VPC?",
      "A": "Currently you can create 200 subnets per VPC. If you would like to create more, please submit a case at the support center ."
    },
    {
      "Q": "Is there a limit on how large or small a subnet can be?",
      "A": "The minimum size of a subnet is a /28 (or 14 IP addresses.) for IPv4. Subnets cannot be larger than the VPC in which they are created. For IPv6, the subnet size is fixed to be a /64. Only one IPv6 CIDR block can be allocated to a subnet."
    },
    {
      "Q": "Can I use all the IP addresses that I assign to a subnet?",
      "A": "No. Amazon reserves the first four (4) IP addresses and the last one (1) IP address of every subnet for IP networking purposes."
    },
    {
      "Q": "How do I assign private IP addresses to Amazon EC2 instances within a VPC?",
      "A": "When you launch an Amazon EC2 instance within a subnet that is not IPv6-only, you may optionally specify the primary private IPv4 address for the instance. If you do not specify the primary private IPv4 address, AWS automatically addresses it from the IPv4 address range you assign to that subnet. You can assign secondary private IPv4 addresses when you launch an instance, when you create an Elastic Network Interface, or any time after the instance has been launched or the interface has been created. In case you launch an Amazon EC2 instance within an IPv6-only subnet, AWS automatically addresses it from the Amazon-provided IPv6 GUA CIDR of that subnet. The instance’s IPv6 GUA will remain private unless you make them reachable to/from the internet with the right security group, NACL, and route table configuration."
    },
    {
      "Q": "Can I change the private IP addresses of an Amazon EC2 instance while it is running and/or stopped within a VPC?",
      "A": "For an instance launched in an IPv4 or dual-stack subnet, the primary private IPv4 address is retained for the instance's or interface's lifetime. Secondary private IPv4 addresses can be assigned, unassigned, or moved between interfaces or instances at any time. For an instance launched in an IPv6-only subnet, the assigned IPv6 GUA which is also the first IP address on the instance's primary network interface can be modified by associating a new IPv6 GUA and removing the existing IPv6 GUA at any time."
    },
    {
      "Q": "If an Amazon EC2 instance is stopped within a VPC, can I launch another instance with the same IP address in the same VPC?",
      "A": "No. An IPv4 address assigned to a running instance can only be used again by another instance once that original running instance is in a “terminated” state. However, the IPv6 GUA assigned to a running instance can be used again by another instance after it is removed from the first instance."
    },
    {
      "Q": "Can I assign IP addresses for multiple instances simultaneously?",
      "A": "No. You can specify the IP address of one instance at a time when launching the instance."
    },
    {
      "Q": "Can I assign any IP address to an instance?",
      "A": "You can assign any IP address to your instance as long as it is: Part of the associated subnet's IP address range Not reserved by Amazon for IP networking purposes Not currently assigned to another interface"
    },
    {
      "Q": "Can I assign multiple IP addresses to an instance?",
      "A": "Yes. You can assign one or more secondary private IP addresses to an Elastic Network Interface or an EC2 instance in Amazon VPC. The number of secondary private IP addresses you can assign depends on the instance type. See EC2 User Guide for more information on the number of secondary private IP addresses that can be assigned per instance type."
    },
    {
      "Q": "Can I assign one or more Elastic IP (EIP) addresses to VPC-based Amazon EC2 instances?",
      "A": "Yes, however, the EIP addresses will only be reachable from the Internet (not over the VPN connection). Each EIP address must be associated with a unique private IP address on the instance. EIP addresses should only be used on instances in subnets configured to route their traffic directly to the Internet gateway. EIPs cannot be used on instances in subnets configured to use a NAT gateway or a NAT instance to access the Internet. This is applicable only for IPv4. Amazon VPCs do not support EIPs for IPv6 at this time."
    },
    {
      "Q": "What is the Bring Your Own IP feature?",
      "A": "Bring Your Own IP (BYOIP) enables customers to move all or part of their existing publicly routable IPv4 or IPv6 address space to AWS for use with their AWS resources. Customers will continue to own the IP range. Customers can create Elastic IPs from the IPv4 space they bring to AWS and use them with EC2 instances, NAT Gateways, and Network Load Balancers. Customers can also associate up to 5 CIDRs to a VPC from the IPv6 space they bring to AWS. Customers will continue to have access to Amazon-supplied IPs and can choose to use BYOIP Elastic IPs, Amazon-supplied IPs, or both."
    },
    {
      "Q": "Why should I use BYOIP?",
      "A": "You may want to bring your own IP addresses to AWS for the following reasons: IP Reputation: Many customers consider the reputation of their IP addresses to be a strategic asset and want to use those IPs on AWS with their resources. For example, customers who maintain services such as outbound e-mail MTA and have high reputation IPs, can now bring over their IP space and successfully maintain their existing sending success rate. Customer whitelisting: BYOIP also enables customers to move workloads that rely on IP address whitelisting to AWS without the need to re-establish the whitelists with new IP addresses. Hardcoded dependencies: Several customers have IPs hardcoded in devices or have taken architectural dependencies on their IPs. BYOIP enables such customers hassle free migration to AWS. Regulation and compliance: Many customers are required to use certain IPs because of regulation and compliance reasons. They too are unlocked by BYOIP. On-prem IPv6 network policy: Many customers can route only their IPv6 in their on-prem network. These customers are unlocked by BYOIP as they can assign their own IPv6 range to their VPC and choose to route to their on-prem network using internet or Direct Connect."
    },
    {
      "Q": "What happens if I release a BYOIP Elastic IP?",
      "A": "When you release a BYOIP Elastic IP it goes back to the BYOIP IP pool from which it was allocated."
    },
    {
      "Q": "In which AWS Regions is BYOIP available?",
      "A": "See our documentation for details on BYOIP availability."
    },
    {
      "Q": "Can a BYOIP prefix be shared with multiple VPCs in the same account?",
      "A": "Yes. You can use the BYOIP prefix with any number of VPCs in the same account."
    },
    {
      "Q": "How many IP ranges can I bring via BYOIP?",
      "A": "You can bring a maximum of five IP ranges to your account."
    },
    {
      "Q": "What is the most specific prefix that I can bring via BYOIP?",
      "A": "Via BYOIP, the most specific IPv4 prefix you can bring is a /24 IPv4 prefix and a /56 IPv6 prefix. If you intend to advertise your Ipv6 prefix to the internet then most specific IPv6 prefix is /48."
    },
    {
      "Q": "Which RIR prefixes can I use for BYOIP?",
      "A": "You can use ARIN, RIPE, and APNIC registered prefixes."
    },
    {
      "Q": "Can I bring a reassigned or reallocated prefix?",
      "A": "We are not accepting reassigned or reallocated prefixes at this time. IP ranges should be a net type of direct allocation or direct assignment."
    },
    {
      "Q": "Can I move a BYOIP prefix from one AWS Region to another?",
      "A": "Yes. You can do that by de-provisioning the BYOIP prefix from the current region and then provisioning it to the new region."
    },
    {
      "Q": "What is VPC IP Address Manager (IPAM)?",
      "A": "Amazon VPC IP Address Manager (IPAM) is a managed service that makes it easier for you to plan, track, and monitor IP addresses for your AWS workloads. Using IPAM, you can easily organize IP addresses based on your routing and security needs and set simple business rules to govern IP address assignments. You can also automate IP address assignment to VPCs, eliminating the need to use spreadsheet-based or homegrown IP address planning applications, which can be hard to maintain and time-consuming. IPAM provides a unified operational view, which can be used as your single source of truth, enabling you to quickly and efficiently perform routine IP address management activities such as tracking IP utilization, troubleshooting, and auditing."
    },
    {
      "Q": "Why should you use IPAM?",
      "A": "You should use IPAM to make IP address management more efficient. Existing mechanisms that leverage spreadsheets or home-grown tools require manual work, and are error-prone. With IPAM, as an example, you can roll out applications faster as your developers no longer need to wait for the central IP address administration team to allocate IP addresses. You can also detect overlapping IP addresses and fix them before there is a network outage. In addition, you can create alarms for IPAM to notify you if the address pools are nearing exhaustion or if resources fail to comply with allocations rules set on a pool. These are some of the many reasons you should use IPAM."
    },
    {
      "Q": "What are the key features offered by IPAM?",
      "A": "AWS IPAM provides the following features: Allocate IP addresses for at-scale networks: IPAM can automate IP address allocations across hundreds of accounts and VPCs based on configurable business rules. Monitor IP usage across your network: IPAM can monitor IP addresses and enables you to get alerts when IPAM detects potential issues such as depleting IP addresses that can stall network’s growth or overlapping IP addresses that can result in erroneous routing. Troubleshoot your network: IPAM can help you quickly identify if connectivity issues are due to IP address misconfigurations or other issues. Audit IP addresses: IPAM automatically retains your IP address monitoring data (up to a maximum of three years). You can use this historical data to do retrospective analysis and audits for your network."
    },
    {
      "Q": "What are the key components of IPAM?",
      "A": "The following are the key components of IPAM: A scope is the highest-level container within IPAM. An IPAM contains two default scopes. Each scope represents the IP space for a single network. The private scope is intended for all private space. The public scope is intended for all public space. Scopes enable you to reuse IP addresses across multiple unconnected networks without causing IP address overlap or conflict. Within a scope, you create IPAM pools. A pool is a collection of contiguous IP address ranges (or CIDRs). IPAM pools enable you to organize your IP addresses according to your routing and security needs. You can have multiple pools within a top-level pool. For example, if you have separate routing and security needs for development and production applications, you can create a pool for each. Within IPAM pools, you allocate CIDRs to AWS resources. An allocation is a CIDR assignment from an IPAM pool to another resource or IPAM pool. When you create a VPC and choose an IPAM pool for the VPC’s CIDR, the CIDR is allocated from the CIDR provisioned to the IPAM pool. You can monitor and manage the allocation with IPAM."
    },
    {
      "Q": "Does IPAM support Bring Your Own IPs (BYOIPs)?",
      "A": "Yes. IPAM supports both BYOIPv4 and BYOIPv6 addresses. BYOIP is an EC2 feature that allows you to bring IP addresses owned by you to AWS. With IPAM, you can directly provision and share their IP address blocks across accounts and organization. Existing BYOIP customers using IPv4 can migrate their pools into IPAM to simplify IP management."
    },
    {
      "Q": "Does Amazon Provide Contiguous CIDR Blocks and how do they work with IPAM?",
      "A": "Yes, Amazon Provides Contiguous IPv6 CIDR blocks for VPC allocation. Contigous CIDR blocks allow you to aggregated CIDRs in a single entry across networking and security constructs like access control lists, route tables, security groups, and firewalls. You can provision Amazon IPv6 CIDRs into a publicly scoped pool, and use all of the IPAM features to manage and monitor IP usage. Allocation of these CIDR blocks start in /52 increments, and larger blocks are available upon request. For example, you can allocate /52 CIDR from Amazon and use IPAM to share across accounts and create VPCs in those accounts."
    },
    {
      "Q": "Can you use Amazon Provided Contiguous IPv6 CIDR blocks without IPAM?",
      "A": "No, Amazon Provided Contiguous IPv6 CIDR blocks are currently only supported in IPAM."
    },
    {
      "Q": "Can I share my IPAM pools with other accounts?",
      "A": "You can share IPAM pools with other accounts in your AWS Organization using AWS Resource Access Manager (RAM). You can also share IPAM pools with accounts outside of your primary AWS Organization. For example, these accounts can represent another line of business in your company or a managed service hosted by a partner on your behalf, in another AWS Organization."
    },
    {
      "Q": "Can I specify which subnet will use which gateway as its default?",
      "A": "Yes. You may create a default route for each subnet. The default route can direct traffic to egress the VPC via the Internet gateway, the virtual private gateway, or the NAT gateway."
    },
    {
      "Q": "How do I secure Amazon EC2 instances running within my VPC?",
      "A": "Amazon EC2 security groups can be used to help secure instances within an Amazon VPC. Security groups in a VPC enable you to specify both inbound and outbound network traffic that is allowed to or from each Amazon EC2 instance. Traffic which is not explicitly allowed to or from an instance is automatically denied. In addition to security groups, network traffic entering and exiting each subnet can be allowed or denied via network Access Control Lists (ACLs)."
    },
    {
      "Q": "What are the differences between security groups in a VPC and network ACLs in a VPC?",
      "A": "Security groups in a VPC specify which traffic is allowed to or from an Amazon EC2 instance. Network ACLs operate at the subnet level and evaluate traffic entering and exiting a subnet. Network ACLs can be used to set both Allow and Deny rules. Network ACLs do not filter traffic between instances in the same subnet. In addition, network ACLs perform stateless filtering while security groups perform stateful filtering."
    },
    {
      "Q": "What is the difference between stateful and stateless filtering?",
      "A": "Stateful filtering tracks the origin of a request and can automatically allow the reply to the request to be returned to the originating computer. For example, a stateful filter that allows inbound traffic to TCP port 80 on a webserver will allow the return traffic, usually on a high numbered port (e.g., destination TCP port 63, 912) to pass through the stateful filter between the client and the webserver. The filtering device maintains a state table that tracks the origin and destination port numbers and IP addresses. Only one rule is required on the filtering device: Allow traffic inbound to the web server on TCP port 80. Stateless filtering, on the other hand, only examines the source or destination IP address and the destination port, ignoring whether the traffic is a new request or a reply to a request. In the above example, two rules would need to be implemented on the filtering device: one rule to allow traffic inbound to the web server on TCP port 80, and another rule to allow outbound traffic from the webserver (TCP port range 49, 152 through 65, 535)."
    },
    {
      "Q": "Can Amazon EC2 instances within a VPC communicate with Amazon EC2 instances not within a VPC?",
      "A": "Yes. If an Internet gateway has been configured, Amazon VPC traffic bound for Amazon EC2 instances not within a VPC traverses the Internet gateway and then enters the public AWS network to reach the EC2 instance. If an Internet gateway has not been configured, or if the instance is in a subnet configured to route through the virtual private gateway, the traffic traverses the VPN connection, egresses from your datacenter, and then re-enters the public AWS network."
    },
    {
      "Q": "Can Amazon EC2 instances within a VPC in one region communicate with Amazon EC2 instances within a VPC in another region?",
      "A": "Yes. Instances in one region can communicate with each other using Inter-Region VPC Peering, public IP addresses, NAT gateway, NAT instances, VPN Connections or Direct Connect connections."
    },
    {
      "Q": "Can Amazon EC2 instances within a VPC communicate with Amazon S3?",
      "A": "Yes. There are multiple options for your resources within a VPC to communicate with Amazon S3. You can use VPC Endpoint for S3, which makes sure all traffic remains within Amazon's network and enables you to apply additional access policies to your Amazon S3 traffic. You can use an Internet gateway to enable Internet access from your VPC and instances in the VPC can communicate with Amazon S3. You can also make all traffic to Amazon S3 traverse the Direct Connect or VPN connection, egress from your datacenter, and then re-enter the public AWS network."
    },
    {
      "Q": "Can I monitor the network traffic in my VPC?",
      "A": "Yes. You can use Amazon VPC traffic mirroring and Amazon VPC flow logs features to monitor the network traffic in your Amazon VPC."
    },
    {
      "Q": "What is Amazon VPC flow logs?",
      "A": "VPC flow logs is a feature that enables you to capture information about the IP traffic going to and from network interfaces in your VPC. Flow logs data can be published to either Amazon CloudWatch Logs or Amazon S3. You can monitor your VPC flow logs to gain operational visibility about your network dependencies and traffic patterns, detect anomalies and prevent data leakage, or troubleshoot network connectivity and configuration issues. The enriched metadata in flow logs help you gain additional insights about who initiated your TCP connections, and the actual packet-level source and destination for traffic flowing through intermediate layers such as the NAT Gateway. You can also archive your flow logs to meet compliance requirements. To learn more about Amazon VPC flow logs, please refer to the documentation ."
    },
    {
      "Q": "How can I use VPC flow logs?",
      "A": "You can create a flow log for a VPC, a subnet, or a network interface. If you create a flow log for a subnet or VPC, each network interface in that subnet or VPC is monitored. While creating a flow log subscription, you can choose the metadata fields you wish to capture, the maximum aggregation interval, and your preferred log destination. You can also choose to capture all traffic or only accepted or rejected traffic. You can use tools like CloudWatch Log Insights or CloudWatch Contributor Insights to analyze your VPC flow logs delivered to CloudWatch Logs. You can use tools like Amazon Athena or AWS QuickSight to query and visualize your VPC flow logs delivered to Amazon S3. You can also build a custom downstream application to analyze your logs or use partner solutions such as Splunk, Datadog, Sumo Logic, Cisco StealthWatch, Checkpoint CloudGuard, New Relic etc."
    },
    {
      "Q": "Do VPC flow logs support AWS Transit Gateway?",
      "A": "Yes, you can create VPC flow log for a Transit Gateway or for an individual Transit Gateway attachment. With this feature Transit Gateway can export detailed information such as source/destination IPs, ports, protocol, traffic counters, timestamps and various metadata for network flows traversing via the Transit Gateway. To learn more about Amazon VPC flow logs support for Transit Gateway, please refer to the documentation."
    },
    {
      "Q": "Does using Flow Logs impact my network latency or performance?",
      "A": "Flow log data is collected outside of the path of your network traffic, and therefore does not affect network throughput or latency. You can create or delete flow logs without any risk of impact to network performance."
    },
    {
      "Q": "How much VPC flow logs cost?",
      "A": "Data ingestion and archival charges for vended logs apply when you publish flow logs to CloudWatch Logs or to Amazon S3. For more information and examples, see Amazon CloudWatch Pricing . You can also track charges from publishing flow logs using cost allocation tags."
    },
    {
      "Q": "What is Amazon VPC traffic mirroring?",
      "A": "Amazon VPC traffic mirroring makes it easy for customers to replicate network traffic to and from an Amazon EC2 instance and forward it to out-of-band security and monitoring appliances for use-cases such as content inspection, threat monitoring, and troubleshooting. These appliances can be deployed on an individual EC2 instance or a fleet of instances behind a Network Load Balancer (NLB) with User Datagram Protocol (UDP) listener."
    },
    {
      "Q": "Which resources can be monitored with Amazon VPC traffic mirroring ?",
      "A": "Traffic mirroring supports network packet captures at the Elastic Network Interface (ENI) level for EC2 instances. Refer to the Traffic Mirroring documentation for the EC2 instances that support Amazon VPC Traffic Mirroring."
    },
    {
      "Q": "What type of appliances are supported with Amazon VPC traffic mirroring?",
      "A": "Customers can either use open source tools or choose from a wide-range of monitoring solution available on AWS Marketplace. Traffic mirroring allows customers to stream replicated traffic to any network packet collector/broker or analytics tool, without requiring them to install vendor-specific agents."
    },
    {
      "Q": "How is Amazon VPC traffic mirroring different from Amazon VPC flow logs?",
      "A": "Amazon VPC flow logs allow customers to collect, store, and analyze network flow logs. The information captured in flow logs includes information about allowed and denied traffic, source and destination IP addresses, ports, protocol number, packet and byte counts, and an action (accept or reject). You can use this feature to troubleshoot connectivity and security issues and to make sure that the network access rules are working as expected. Amazon VPC traffic mirroring, provides deeper insight into network traffic by allowing you to analyze actual traffic content, including payload, and is targeted for use-cases when you need to analyze the actual packets to determine the root cause a performance issue, reverse-engineer a sophisticated network attack, or detect and stop insider abuse or compromised workloads."
    },
    {
      "Q": "Within which Amazon EC2 region(s) is Amazon VPC available?",
      "A": "Amazon VPC is currently available in multiple Availability Zones in all Amazon EC2 regions."
    },
    {
      "Q": "Can a VPC span multiple Availability Zones?",
      "A": "Yes."
    },
    {
      "Q": "Can a subnet span Availability Zones?",
      "A": "No. A subnet must reside within a single Availability Zone."
    },
    {
      "Q": "How do I specify which Availability Zone my Amazon EC2 instances are launched in?",
      "A": "When you launch an Amazon EC2 instance, you must specify the subnet in which to launch the instance. The instance will be launched in the Availability Zone associated with the specified subnet."
    },
    {
      "Q": "How do I determine which Availability Zone my subnets are located in?",
      "A": "When you create a subnet you must specify the Availability Zone in which to place the subnet. When using the VPC Wizard, you can select the subnet's Availability Zone in the wizard confirmation screen. When using the API or the CLI you can specify the Availability Zone for the subnet as you create the subnet. If you don’t specify an Availability Zone, the default \"No Preference\" option will be selected and the subnet will be created in an available Availability Zone in the region."
    },
    {
      "Q": "Am I charged for network bandwidth between instances in different subnets?",
      "A": "If the instances reside in subnets in different Availability Zones, you will be charged $0.01 per GB for data transfer."
    },
    {
      "Q": "When I call DescribeInstances(), do I see all of my Amazon EC2 instances, including those in EC2-Classic and EC2-VPC?",
      "A": "Yes. DescribeInstances() will return all running Amazon EC2 instances. You can differentiate EC2-Classic instances from EC2-VPC instances by an entry in the subnet field. If there is a subnet ID listed, the instance is within a VPC."
    },
    {
      "Q": "When I call DescribeVolumes(), do I see all of my Amazon EBS volumes, including those in EC2-Classic and EC2-VPC?",
      "A": "Yes. DescribeVolumes() will return all your EBS volumes."
    }
  ]
}